import classes from './ApisForm.module.css';
import serialNumberImage from '../../assets/images/popup-img-min.png';

import AdvicePopup from '../UI/AdvicePopup';

const ApisForm = () => {
  return (
    <form action="#" onsubmit="return false" className={classes['apis-form']}>

      <div className={classes['number-text']}>
        <span>
          Введите серийный номер
        </span>
        <AdvicePopup image={serialNumberImage} text="Серийный номер здесь:" />
      </div>

      <div className={classes.input}>
        <div className={classes['input__main']}>
          <input type="number" required />
          <div className={classes['input__main-close']}>
            <svg width="19" height="19" viewBox="0 0 19 19" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M0 0.853575C0 1.28766 0.0614052 1.38075 0.36179 1.67928C1.17345 2.48604 8.04212 9.31802 8.16406 9.50005C8.05932 9.6564 6.2777 11.4049 6.09523 11.5874L0.380298 17.3022C0.0717482 17.6098 0 17.7042 0 18.1465C0 18.6067 0.402618 19 1.00197 19C1.43714 19 1.83606 18.4813 2.19872 18.1187L9.50005 10.8359C9.68775 10.9617 16.4808 17.7952 17.3022 18.6197C17.6098 18.9284 17.7042 19 18.1465 19C18.6067 19 19 18.5974 19 17.998C19 17.5629 18.4813 17.1639 18.1187 16.8013C17.4982 16.1807 10.9608 9.68656 10.8359 9.50005C10.9523 9.32618 14.8447 5.47268 14.983 5.33452L18.6197 1.69779C18.9284 1.39022 19 1.29582 19 0.853575C19 0.372786 18.5931 0 17.998 0C17.5597 0 17.1727 0.509968 16.8013 0.881338C16.4458 1.23681 16.1177 1.56496 15.7622 1.92044L10.0474 7.63525C9.89407 7.78855 9.66054 8.0566 9.50005 8.16406C9.31159 8.03798 2.52044 1.20578 1.69779 0.380407C1.38946 0.0709861 1.30693 0 0.853575 0C0.421562 0 0 0.421562 0 0.853575H0Z" fill="#ACACAC" />
            </svg>
          </div>
        </div>

        <div className={classes['input__list']}>
          <div className={classes['input__list-item']}>
            <span>328309</span>
            <div className={classes['input__list-item-trigger']}></div>
            <div className={classes['input__list-item-close']}>
              <svg width="19" height="19" viewBox="0 0 19 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M0 0.853575C0 1.28766 0.0614052 1.38075 0.36179 1.67928C1.17345 2.48604 8.04212 9.31802 8.16406 9.50005C8.05932 9.6564 6.2777 11.4049 6.09523 11.5874L0.380298 17.3022C0.0717482 17.6098 0 17.7042 0 18.1465C0 18.6067 0.402618 19 1.00197 19C1.43714 19 1.83606 18.4813 2.19872 18.1187L9.50005 10.8359C9.68775 10.9617 16.4808 17.7952 17.3022 18.6197C17.6098 18.9284 17.7042 19 18.1465 19C18.6067 19 19 18.5974 19 17.998C19 17.5629 18.4813 17.1639 18.1187 16.8013C17.4982 16.1807 10.9608 9.68656 10.8359 9.50005C10.9523 9.32618 14.8447 5.47268 14.983 5.33452L18.6197 1.69779C18.9284 1.39022 19 1.29582 19 0.853575C19 0.372786 18.5931 0 17.998 0C17.5597 0 17.1727 0.509968 16.8013 0.881338C16.4458 1.23681 16.1177 1.56496 15.7622 1.92044L10.0474 7.63525C9.89407 7.78855 9.66054 8.0566 9.50005 8.16406C9.31159 8.03798 2.52044 1.20578 1.69779 0.380407C1.38946 0.0709861 1.30693 0 0.853575 0C0.421562 0 0 0.421562 0 0.853575H0Z" fill="#ACACAC" />
              </svg>
            </div>
          </div>
          <div className={classes['input__list-item']}>
            <span>322323</span>
            <div className={classes['input__list-item-trigger']}></div>
            <div className={classes['input__list-item-close']}>
              <svg width="19" height="19" viewBox="0 0 19 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M0 0.853575C0 1.28766 0.0614052 1.38075 0.36179 1.67928C1.17345 2.48604 8.04212 9.31802 8.16406 9.50005C8.05932 9.6564 6.2777 11.4049 6.09523 11.5874L0.380298 17.3022C0.0717482 17.6098 0 17.7042 0 18.1465C0 18.6067 0.402618 19 1.00197 19C1.43714 19 1.83606 18.4813 2.19872 18.1187L9.50005 10.8359C9.68775 10.9617 16.4808 17.7952 17.3022 18.6197C17.6098 18.9284 17.7042 19 18.1465 19C18.6067 19 19 18.5974 19 17.998C19 17.5629 18.4813 17.1639 18.1187 16.8013C17.4982 16.1807 10.9608 9.68656 10.8359 9.50005C10.9523 9.32618 14.8447 5.47268 14.983 5.33452L18.6197 1.69779C18.9284 1.39022 19 1.29582 19 0.853575C19 0.372786 18.5931 0 17.998 0C17.5597 0 17.1727 0.509968 16.8013 0.881338C16.4458 1.23681 16.1177 1.56496 15.7622 1.92044L10.0474 7.63525C9.89407 7.78855 9.66054 8.0566 9.50005 8.16406C9.31159 8.03798 2.52044 1.20578 1.69779 0.380407C1.38946 0.0709861 1.30693 0 0.853575 0C0.421562 0 0 0.421562 0 0.853575H0Z" fill="#ACACAC" />
              </svg>
            </div>
          </div>
        </div>
      </div>

      <button className={classes.btn}>
        Проверить
      </button>

      <input type="checkbox" id="online" />

      <div className={classes['checkbox-wrap']}>
        <span>
          Обновлять данные онлайн<span>:</span><span>?</span>
        </span>
        <div className={classes['checkbox-btn']}>
          <span className={classes['active']}>
            Да
          </span>
          <span>
            Нет
          </span>
        </div>
      </div>
      
    </form>
  );
}

export default ApisForm;